export const workList = [
    {
        companyName: '浙江网新电气科技有限公司',
        job: '前端开发工程师',
        time: '2020.3-至今',
        desc: [
            '1、根据公司网页版运维管理平台逻辑及接口独立开发运维管理平台安卓APP；',
            '2、对公司已有项目前端部分进行功能增加修改；',
            '3、和同事一起开发新项目的前端部分功能模块。'
        ]
    },
    {
        companyName: '杭州兔狗科技有限公司',
        job: '前端开发工程师',
        time: '2019.4-2020.3',
        desc: [
            '1、主要负责公司小程序，移动端网页及app的前端开发和维护；',
            '2、参与公司新产品功能需求的技术评估以及开发；',
            '3、对公司官网和管理后台进行开发以及维护；',
            '4、带着实习生熟悉公司业务及技术，解决其遇到的大部分问题；',
            '5、公司项目涉及技术栈较多，需要学习使用各种前端技术。'
        ]
    },
    {
        companyName: '贝因美婴童食品有限公司',
        job: '前端开发实习生',
        time: '2018.8-2018.12',
        desc: [
            '1、主要负责公司微信公众号每月会员活动日h5小游戏的编写；',
            '2、和UI交接素材和后端对接口。'
        ]
    }
]

export const projectList = [
    {
        name: '网新运维管理平台安卓APP 1.0版',
        time: '2020.3 - 2020.8',
        work: '安卓app开发',
        desc: [
            '1、根据网页版运维平台的逻辑增加部分功能新做一个手机端的运维平台',
            '2、独立使用uni-app进行安卓app开发并进行云打包'
        ]
    },
    {
        name: '“美翎服疗”app',
        time: '2019.12 - 2020.2',
        work: 'app及管理后台前端开发',
        desc: [
            '1、使用flutter进行app开发，个人主要负责业务逻辑以及部分组件的开发。',
            '2、后台前端使用typescript+vue-cli开发，个人主要负责权限管理功能，使用vuex+vue-route实现。'
        ]
    },
    {
        name: '“流量蜂”系统一期',
        time: '2019.9 - 2019.12',
        work: '小程序及管理后台前端开发',
        desc: [
            '1、流量蜂项目是一个分销系统，我们开发第三方小程序，让客户可以在后台进行小程序配置生成小程序，利用小程序进行商品分销。',
            '2、技术实现小程序使用mpvue+vuex开发，管理后台使用typescript+vue+ant design开发。',
            '3、流量蜂后台主要用于商品、用户、小程序的管理，流量蜂小程序实现分享及购买功能。'
        ]
    },
    {
        name: '“aha畅学礼包”小程序',
        time: '2019.6 - 2019.9',
        work: '小程序开发',
        desc: [
            '1、该小程序主要用于公司aha年卡的分销，是公司重要收入来源。',
            '2、小程序使用mpvue框架进行开发，主要实现商品、分享功能，支付通过外部h5实现购买。'
        ]
    },
    {
        name: '“喜得宝”管理后台',
        time: '2019.4 - 2019.8',
        work: '前端开发实习生',
        desc: [
            '1、喜得宝是公司内部使用的管理系统，主要用于公司各个产品线日常工作开展。',
            '2、属于实习的练手项目，后台前端使用vue+elementUI实现，部分老代码还使用jQuery。'
        ]
    },
    {
        name: '学生选课管理系统',
        time: '2019.3 - 2019.4',
        work: '毕业设计项目',
        desc: [
            '前端使用原生微信小程序开发，后端使用springboot+jpa构建项目，使用mysql数据库，使用git进行版本控制。'
        ]
    }
]
