export const skillList = [
    '精通HTML5，CSS3，熟练掌握ES6，熟练使用原生JavaScript编程，熟知主流浏览器特性以及浏览器渲染原理，能编写符合W3C标准的代码。',
    '熟悉VUE框架，熟练使用vue全家桶，具有代码优化、简化、模块化、组件化等良好的编码方式。',
    '熟悉sass等css预处理器，flex等布局方式，使用过phaser、lufylegend等h5游戏引擎。',
    '熟悉微信小程序开发，使用过原生小程序及mpvue、wepy等框架，有第三方小程序开发经验。',
    '拥有flutter、uni-app等跨平台开发的实战经验，处理多种手机兼容适配问题。',
    '明白get/post/put区别，了解http协议及浏览器原理，掌握前端问题的定位方法，了解基本的前端体验提升及性能优化',
    '了解软件工程、敏捷开发相关概念及流程，了解跨域，CSRF、XSS等web安全性的问题。',
    '熟悉使用版本控制工具进行协同开发，如 GIT，SVN 等，熟悉协同开发工作流。',
    '使用过服务端开发语言java，使用过springboot，jpa，了解mysql数据库，能写基本的sql语句'
]

export const workList = [
    {
        companyName: '浙江网新电气科技有限公司',
        job: '前端开发工程师',
        time: '2020.3-至今',
        tags: ['Vue', 'uni-app'],
        desc: [
            '1、根据公司网页版运维管理平台逻辑及接口独立开发运维管理平台安卓APP；',
            '2、对公司已有项目前端部分进行功能增加修改；',
            '3、和同事一起开发新项目的前端部分功能模块。'
        ]
    },
    {
        companyName: '杭州兔狗科技有限公司',
        job: '前端开发工程师',
        time: '2019.4-2020.3',
        tags: ['微信小程序', 'Vue', 'jQuery'],
        desc: [
            '1、主要负责公司小程序，移动端网页及app的前端开发和维护；',
            '2、参与公司新产品功能需求的技术评估以及开发；',
            '3、对公司官网和管理后台进行开发以及维护；',
            '4、带着实习生熟悉公司业务及技术，解决其遇到的大部分问题；',
            '5、公司项目涉及技术栈较多，需要学习使用各种前端技术。'
        ]
    },
    {
        companyName: '贝因美婴童食品有限公司',
        job: '前端开发实习生',
        time: '2018.8-2018.12',
        tags: ['jQuery', 'DIV+CSS', 'JavaScript'],
        desc: [
            '1、主要负责公司微信公众号每月会员活动日h5小游戏的编写；',
            '2、和UI交接素材和后端对接口。'
        ]
    }
]

export const projectList = [
    {
        name: '龙游公路桥梁实时监测系统暨数字化管理系统',
        time: '2021.11 - 2022.3',
        work: '跨平台前端开发',
        desc: [
            '1、项目描述：龙游桥梁的硬件设备、工单、人员、应急告警、考核的展示和管理',
            '2、技术栈：使用uni-app+vuex进行跨平台开发，后台管理系统使用vue+vuex+vue-router+echarts',
            '3、负责模块：整个小程序和APP的开发，后台负责数字驾驶舱模块，主要为各种可视化图表'
        ]
    },
    {
        name: '大兴机场旅客无纸化复核',
        time: '2021.3 - 2021.7',
        work: 'APP开发',
        desc: [
            '1、项目描述：使用APP给旅客进行人脸识别复核',
            '2、技术栈：使用uni-app进行APP开发',
            '3、负责模块：APP开发，和原生模块对接',
            '4、重难点：和原生模块对接调试'
        ]
    },
    {
        name: '首都机场物联网平台',
        time: '2020.8 - 2021.7',
        work: 'web前端开发',
        desc: [
            '1、项目描述：给首都机场使用的物联网平台，可以自定义可视化组件，管理硬件设备，人车定位及告警等',
            '2、技术栈：vue+vuex+vue-router+elementUI+websocket+echarts+arcgis',
            '3、负责模块：主要负责部件库、应用库的开发，以及部分部件开发',
            '4、重难点：渲染自定义部件'
        ]
    },
    {
        name: '网新运维管理平台安卓APP 1.0版',
        time: '2020.3 - 2020.8',
        work: '安卓app开发',
        desc: [
            '1、根据网页版运维平台的逻辑增加部分功能新做一个手机端的运维平台',
            '2、独立使用uni-app进行安卓app开发并进行云打包'
        ]
    },
    {
        name: '“美翎服疗”app',
        time: '2019.12 - 2020.2',
        work: 'app及管理后台前端开发',
        desc: [
            '1、使用flutter进行app开发，个人主要负责业务逻辑以及部分组件的开发。',
            '2、后台前端使用typescript+vue-cli开发，个人主要负责权限管理功能，使用vuex+vue-route实现。'
        ]
    },
    {
        name: '“流量蜂”系统一期',
        time: '2019.9 - 2019.12',
        work: '小程序及管理后台前端开发',
        desc: [
            '1、流量蜂项目是一个分销系统，我们开发第三方小程序，让客户可以在后台进行小程序配置生成小程序，利用小程序进行商品分销。',
            '2、技术实现小程序使用mpvue+vuex开发，管理后台使用typescript+vue+ant design开发。',
            '3、流量蜂后台主要用于商品、用户、小程序的管理，流量蜂小程序实现分享及购买功能。'
        ]
    },
    {
        name: '“aha畅学礼包”小程序',
        time: '2019.6 - 2019.9',
        work: '小程序开发',
        desc: [
            '1、该小程序主要用于公司aha年卡的分销，是公司重要收入来源。',
            '2、小程序使用mpvue框架进行开发，主要实现商品、分享功能，支付通过外部h5实现购买。'
        ]
    },
    {
        name: '“喜得宝”管理后台',
        time: '2019.4 - 2019.8',
        work: '前端开发实习生',
        desc: [
            '1、喜得宝是公司内部使用的管理系统，主要用于公司各个产品线日常工作开展。',
            '2、属于实习的练手项目，后台前端使用vue+elementUI实现，部分老代码还使用jQuery。'
        ]
    },
    {
        name: '学生选课管理系统',
        time: '2019.3 - 2019.4',
        work: '毕业设计项目',
        desc: [
            '前端使用原生微信小程序开发，后端使用springboot+jpa构建项目，使用mysql数据库，使用git进行版本控制。'
        ]
    }
]
